rails-contact/app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1  [["user_id", 2]]
---
  def index
    @contacts = Contact.all.where(:user_id => current_user.id).sort_by {|sort| sort.firstName}

INSERT INTO "contacts" ("firstName", "lastName", "phoneNumber", "email", "address", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    # contact_static = {"user_id" =>current_user.id, "firstName"=>"cfgvhbjnkm", "lastName"=>"gvhbjnkm", "phoneNumber"=>"2345675677", "email"=>"hariven1998@gmail.com", "address"=>"tnj"}
    # params[:contact][:user_id] = current_user.id
    @contact = Contact.new(contact_params)
    puts "@contact -- #{@contact.inspect}"
    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "address" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["address", "kum"], ["updated_at", "2021-02-10 15:48:28.666384"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)